---
title: "Help on Aztech WL230 USB"
date: 2007-07-14
forum: Networking &amp; Wireless
---

### Post by taktak2 on 2007-07-14
I tried installing this usb wireless card. It came with a driver compressed in .tar.gz

After I untar it on the desktop, I go to the directory (on the terminal) and run "make".

This is what it came out

/lib/modules/2.6.20-15-generic/build
/home/hafiz/Desktop/WL
-I/home/hafiz/Desktop/WL/src/include -fomit-frame-pointer -O2 -Wall -DZDCONF_WE_STAT_SUPPORT=1 -DHOST_IF_USB -DAMAC -DGCCK -DOFDM -DHOSTAPD_SUPPORT -DUSE_EP4_SET_REG -DDOWNLOADFIRMWARE -DfTX_GAIN_OFDM=0 -DfNEW_CODE_MAP=1 -DfWRITE_WORD_REG=1 -DfREAD_MUL_REG=1 -DENHANCE_RX=1 -DZDCONF_MENUDBG -DZDCONF_APDBG -DZDCONF_BANDEDGE_ADJUST -DZDCONF_SES_SUPPORT=1 -DZD1211B -DZDCONF_LP_SUPPORT=1
src/zd1205.o src/zdreq.o src/zdasocsvc.o src/zdauthreq.o src/zdauthrsp.o src/zdmmrx.o src/zdshared.o src/zdhci.o src/zdglobal.o src/zdencrypt.o src/zdpmfilter.o src/zdpsmon.o src/zdsynch.o src/zdbuf.o src/zd1205_proc.o src/zdhw.o src/zddebug.o src/zdtkipseed.o src/zdmic.o src/zddebug2.o src/zdlpmgt.o src/zdturbo_burst.o src/zdusb.o src/zd1211.o
make -C /lib/modules/2.6.20-15-generic/build SUBDIRS=/home/hafiz/Desktop/WL modules
make[1]: Entering directory `/usr/src/linux-headers-2.6.20-15-generic'
  CC [M]  /home/hafiz/Desktop/WL/src/zd1205.o
/home/hafiz/Desktop/WL/src/zd1205.c:34:26: error: linux/config.h: No such file or directory
/home/hafiz/Desktop/WL/src/zd1205.c:466: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬ЛњwriteГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:466: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬ЛњfdГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:466: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬ЛњbufГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:466: error: expected declaration specifiers or Гўв‚¬Лњ...Гўв‚¬в„ў before Гўв‚¬ЛњcountГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:467: warning: type defaults to Гўв‚¬ЛњintГўв‚¬в„ў in declaration of Гўв‚¬Лњ_syscall3Гўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:467: error: expected Гўв‚¬Лњ,Гўв‚¬в„ў or Гўв‚¬Лњ;Гўв‚¬в„ў before Гўв‚¬Лњ_syscall3Гўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:472: error: Гўв‚¬Лњdot11A_ChannelГўв‚¬в„ў undeclared here (not in a function)
/home/hafiz/Desktop/WL/src/zd1205.c: In function Гўв‚¬Лњzd1205_validate_frameГўв‚¬в„ў:
/home/hafiz/Desktop/WL/src/zd1205.c:2760: warning: unused variable Гўв‚¬Лњlen1Гўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c: In function Гўв‚¬Лњzd1205_load_card_settingГўв‚¬в„ў:
/home/hafiz/Desktop/WL/src/zd1205.c:8384: warning: implicit declaration of function Гўв‚¬ЛњopenГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8401: warning: implicit declaration of function Гўв‚¬ЛњreadГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8405: warning: implicit declaration of function Гўв‚¬ЛњcloseГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c: In function Гўв‚¬Лњzd1205_save_card_settingГўв‚¬в„ў:
/home/hafiz/Desktop/WL/src/zd1205.c:8557: warning: implicit declaration of function Гўв‚¬ЛњwriteГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c: In function Гўв‚¬Лњzdcb_setup_next_sendГўв‚¬в„ў:
/home/hafiz/Desktop/WL/src/zd1205.c:8945: warning: unused variable Гўв‚¬ЛњloopCntГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8973: warning: unused variable Гўв‚¬ЛњtmpDataTimeГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8972: warning: unused variable Гўв‚¬ЛњLastDataГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8982: warning: label Гўв‚¬ЛњTX_LOOPГўв‚¬в„ў defined but not used
/home/hafiz/Desktop/WL/src/zd1205.c:8880: warning: unused variable Гўв‚¬ЛњLP_CNT_LAST_LATENCYГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c:8824: warning: unused variable Гўв‚¬ЛњtbdidxГўв‚¬в„ў
/home/hafiz/Desktop/WL/src/zd1205.c: In function Гўв‚¬ЛњCalculateQualityГўв‚¬в„ў:
/home/hafiz/Desktop/WL/src/zd1205.c:10220: warning: unused variable Гўв‚¬ЛњrxOffsetГўв‚¬в„ў
make[2]: *** [/home/hafiz/Desktop/WL/src/zd1205.o] Error 1
make[1]: *** [_module_/home/hafiz/Desktop/WL] Error 2
make[1]: Leaving directory `/usr/src/linux-headers-2.6.20-15-generic'
make: *** [all] Error 2

Can anybody help with this?
The folder name is WL.
I've installed the build-essential from the cd. I'm using Ubuntu. 7.04

---

### Post by apoth on 2007-07-14
I'm not sure, but perhaps try:

```
sudo aptitude install linux-headers-`uname -r`
```

---

### Post by taktak2 on 2007-07-14
What does the command do?

I'm installing a usb card to connect to the internet, so of course I can't connect to the internet right now using Ubuntu. I only have the Ubuntu installation cd.

---

